Documents/ВозвратТовараОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВозвратТовараОтПокупателя</Name>
			<Comment>Возврат проданного товара от покупателя</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусовКНачислениюПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчитыватьБонусы</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВидБонуснойСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБонусныхСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусыКНачислению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОпределенияСебестоимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОпределенияСебестоимостиПоВозвратам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьЗаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпенсацияПоВозврату</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыКомпенсацииПоВозврату</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UDS_ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UDS_ИдентификаторОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗачетАванса</Name>
					<Comment>#12822</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеТоваров</Name>
			<Comment>Списание товаров</Comment>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ВозвратТовараОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВозвратТовараОтПокупателя/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ВозвратТовараОтПокупателя";
    КомандаПечати.Идентификатор = "НакладнаяНаВозврат";
    КомандаПечати.Представление = НСтр("ru = 'Накладная на возврат'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.МестоРазмещения = "ПодменюПечатьВозвратТовараОтПокупателя"; // для АРМ Производства
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяНаВозврат") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"НакладнаяНаВозврат",
        	НСтр("ru = 'Накладная на возврат'"),
        	СформироватьПечатнуюФормуВозвратаКлиенту(МассивОбъектов, ОбъектыПечати));
    КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	Запрос.Текст = 	
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеДокумента.Ссылка КАК Ссылка,
    |	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
    |	ДанныеДокумента.Номер КАК Номер,
    |	ДанныеДокумента.Дата КАК Дата,
    |	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Склад КАК Склад,
    |	ДанныеДокумента.Валюта КАК Валюта,
    |	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	ДанныеДокумента.Комментарий КАК Комментарий,
    |	ДанныеДокумента.Контрагент КАК Контрагент,
    |	ДанныеДокумента.Организация КАК Организация,
    |	ДанныеДокумента.Автор КАК Автор,
    |	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
    |	ДанныеДокумента.Основание КАК Основание,
    |	0 КАК ИтогоСуммаНДС,
    |	0 КАК ИтогоСуммаБезНДС,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.БИК КАК БанковскийСчетБИК,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
    |	ДанныеДокумента.Организация.ОсновнойБанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
    |	ДанныеДокумента.Организация.ИНН КАК ИНН,
    |	ДанныеДокумента.Организация.КПП КАК КПП,
    |	ДанныеДокумента.Организация.Руководитель КАК ФИОРуководителя,
    |	ДанныеДокумента.Организация.ГлавныйБухгалтер КАК ФИОГлавБухгалтера,
    |	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	ВЫБОР
    |		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
    |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
    |	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
    |	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НомерСчета КАК КонтрагентБанковскийСчетНомерСчета,
    |	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.БИК КАК КонтрагентБанковскийСчетБИК,
    |	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.КоррСчет КАК КонтрагентБанковскийСчетКоррСчет,
    |	ДанныеДокумента.Контрагент.ОсновнойБанковскийСчет.НаименованиеБанка КАК КонтрагентБанковскийСчетНаименованиеБанка,
    |	ДанныеДокумента.Организация.Руководитель.Должность КАК ДолжностьРуководителя,
    |	ДанныеДокумента.ДисконтнаяКарта КАК ДисконтнаяКарта
    |ИЗ
    |	Документ.ВозвратТовараОтПокупателя КАК ДанныеДокумента
    |ГДЕ
    |	ДанныеДокумента.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ДанныеТабличнойЧасти.СерияНоменклатуры КАК СерияНоменклатуры,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
    |	ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
    |	ДанныеТабличнойЧасти.Сумма - ДанныеТабличнойЧасти.СуммаНДС КАК СуммаБезНДС,
    |	ДанныеТабличнойЧасти.Сумма КАК СуммаСНДС,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод
    |ИЗ
    |	Документ.ВозвратТовараОтПокупателя.Товары КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка";
    
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиТовары);
	
	Возврат СтруктураДанныхДляПечати;
    
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам = Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		Если НЕ ВыборкаПоТоварам = Неопределено Тогда
			СтруктураПоиска = Новый Структура("Ссылка", ТекущаяСтрока.Ссылка);
			ВыборкаПоТоварам.Сбросить();
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда				
				ТекущаяСтрока.ИтогоСуммаНДС = ВыборкаПоТоварам.СуммаНДС;
				ТекущаяСтрока.ИтогоСуммаБезНДС = ВыборкаПоТоварам.Сумма - ВыборкаПоТоварам.СуммаНДС;
			КонецЕсли;						
		КонецЕсли;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуВозвратаКлиенту(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВозвратТоваровОтПокупателя_Накладная";
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = ПолучитьОбщийМакет("ТоварнаяНакладная");		
		Попытка
			ТекстЗаголовка = "Возврат от покупателя №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.Дата, "ДЛф=Д");
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Сумма = 0;
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл				
				Попытка					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					//++ №12909
					//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
					ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
					//-- №12909
					ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					
					Сумма = Сумма + Выборка.Сумма;
					
				Исключение
				КонецПопытки;				
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ОбластьМакета.Параметры.Сумма = Сумма;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
			
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ИспользоватьЗаявкиНаРасходованиеДенежныхСредств = Константы.ИспользоватьЗаявкиНаРасходованиеДенежныхСредств.Получить();
	
	Если ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		Документы.ЗаявкаНаРасходованиеДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, 10);
	КонецЕсли;
	
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Истина, 20);
	
	Если Не ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, 30);
	КонецЕсли;
	
	Документы.СписаниеТоваров.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, 40);
	
	Документы.Премия.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, 50);
	
	Документы.Штраф.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, 60);
	
КонецПроцедуры

// Добавляет команду создания документа "Возврат товара от покупателя"
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ВозвратТовараОтПокупателя) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ВозвратТовараОтПокупателя.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ВозвратТовараОтПокупателя.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
